#include <iostream>

int main() {
    int h1, min1;
    int h2, min2;

    // Запрашиваем данные у пользователя так как констант не дали );
    std::cout << "Введите время начала (часы и минуты через пробел): ";
    std::cin >> h1 >> min1;

    std::cout << "Введите время окончания (часы и минуты через пробел): ";
    std::cin >> h2 >> min2;

    // Переводим всё время в минуты , это гораздо удобнее чем решать отдельно с часами и минутами т.к не придется занимать час в случае минут с минусом
    int start_in_minutes = h1 * 60 + min1;
    int end_in_minutes = h2 * 60 + min2;

    //  Находим разницу в минутах!
    int diff_minutes = end_in_minutes - start_in_minutes;

    // Страховка на случай, если решение перешло через полночь (00:00) - иными словами время конца меньше чем время начала (по числам)
    if (diff_minutes < 0) {
        diff_minutes = diff_minutes + 1440; // 1440 мин это 24 часа * 60 мин
    }

    // Переводим обратно в часы и минуты
    int result_hours = diff_minutes / 60;     // Целая часть от деления - часы
    int result_minutes = diff_minutes % 60;   // Остаток от деления - минуты

    std::cout << "Студент решал задачи: " << result_hours << " часов " << result_minutes << " минут" << std::endl;

    return 0;
}