#include <iostream>

int main() {
    int x, y;
    double a, b, c, k;

    std::cout << "Введите целые X и Y через пробел: ";
    std::cin >> x >> y;

    std::cout << "Введите различные вещественные A, B, C и число K: ";
    std::cin >> a >> b >> c >> k;

    // Работа с целыми X и Y
    if (x < y) {
        x = 0; // X меньше приводим его к нулю
    } else if (y < x) {
        y = 0; // Y меньше приводим его к нулю
    } else {
        x = 0; y = 0; // Случай где они равны, зануляем оба
    }

    // Работа с вещественными A, B, C т.о типа double
    // Так как числа по условию различные, ищем строго наибольшее!
    if (a > b && a > c) {  
        a -= k; // A — самое большое
    } else if (b > a && b > c) {
        b -= k; // B — самое большое
    } else {
        c -= k; // C — самое большое
    }

    //ВЫВОД
    std::cout << "\n Результаты работы программы:" << std::endl;
    std::cout << "X = " << x << ", Y = " << y << std::endl;
    std::cout << "A = " << a << ", B = " << b << ", C = " << c << std::endl;

    return 0;
}