#include <iostream>
#include <cmath> // По сути используем только для pow() - возведения в степень

int main() {
    int n;
    double a, b, c, Y;

    std::cout << "[Наша ветка task7] Введите переменные a, b, c и целое N : ";
    std::cin >> a >> b >> c >> n;

    // Оператор switch(фишка-скорость) проверяет точное равенство целого числа n (только целого числа) double - нельзя (!=. сравнения - нельзя , только строгое равенство!)
    switch (n) {
        case 2:
            Y = b * c - std::pow(a, 2);
            break; // Зачем нам break? switch - весьма глупая команда: при выполнении лишь одного условия он выполнит не только код соответствующий  условию , а всё подряд , забирая чужие формулы не подходя под условие , break единственное что может остановить т.к break сворачивает работу только того оператора внутри которого он находится
        
        case 56: // Логика: работает так - если n==56 выполним код внутри
            Y = b * c;
            break;
        
        case 7:
            Y = std::pow(a, 2) + c;
            break;
        
        case 3:
            Y = a - b * c;
            break;
        
        default:
            // default срабатывает во всех остальных случаях (как финальный else , прям точь в точь)
            Y = std::pow(a + b, 3);
            break;
    }

    std::cout << "Результат вычислений Y = " << Y << std::endl;

    return 0;
}