#include <iostream>

int main() {
    
    const int n = 12; // Мой номер в журнале n = 12 по усл он и является n
    double b1;

    std::cout << "Введите первый член прогрессии (b1): "; // Запрашиваем числовое значение на ввод
    std::cin >> b1;

    double q = 1.0 / (n + 1); // Считаем строго по формуле задачи взяли её из условия
    double S = b1 / (1.0 - q); // Тут воспользовались формулой суммы всех элементов убывающей последовательности  
// Очень ваЖный нюанс 1.0 обязательно писать - результат операции вычисляется исходя из типов данных в этой операции , нас интересует ответ в double так что операция обязана содерЖать double
    std::cout << "Сумма бесконечно убывающей прогрессии (S): " << S << std::endl;

    return 0;
}